/* Copyright (c) Xen Project.
 * Copyright (c) Cloud Software Group, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms,
 * with or without modification, are permitted provided
 * that the following conditions are met:
 *
 * *   Redistributions of source code must retain the above
 *     copyright notice, this list of conditions and the
 *     following disclaimer.
 * *   Redistributions in binary form must reproduce the above
 *     copyright notice, this list of conditions and the
 *     following disclaimer in the documentation and/or other
 *     materials provided with the distribution.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND
 * CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
 * SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
 * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
 * SUCH DAMAGE.
 */

#include <ntddk.h>
#include <stdarg.h>
#include <xen.h>

#include "names.h"
#include "dma.h"
#include "fdo.h"
#include "pdo.h"
#include "dbg_print.h"
#include "assert.h"
#include "util.h"

#pragma warning(push)
#pragma warning(disable:4201) // nameless struct/union

/* 32-bit Server 2008 */

/*
0: kd> dt nt!_OBJECT_HEADER
   +0x000 PointerCount     : Int4B
   +0x004 HandleCount      : Int4B
   +0x004 NextToFree       : Ptr32 Void
   +0x008 Type             : Ptr32 _OBJECT_TYPE
   +0x00c NameInfoOffset   : UChar
   +0x00d HandleInfoOffset : UChar
   +0x00e QuotaInfoOffset  : UChar
   +0x00f Flags            : UChar
   +0x010 ObjectCreateInfo : Ptr32 _OBJECT_CREATE_INFORMATION
   +0x010 QuotaBlockCharged : Ptr32 Void
   +0x014 SecurityDescriptor : Ptr32 Void
   +0x018 Body             : _QUAD
*/

struct _OBJECT_HEADER {
    LONG            PointerCount;
    union {
        LONG        HandleCount;
        PVOID       NextToFree;
    };
    POBJECT_TYPE    Type;
    UCHAR           NameInfoOffset;
    UCHAR           HandleInfoOffset;
    UCHAR           QuotaInfoOffset;
    UCHAR           Flags;
    union {
        PVOID       ObjectCreateInfo;
        PVOID       QuotaBlockCharged;
    };
    PVOID           SecurityDescriptor;
};

/*
0: kd> dt hal!_ADAPTER_OBJECT
hal!_ADAPTER_OBJECT
   +0x000 DmaHeader        : _DMA_ADAPTER
   +0x008 MasterAdapter    : Ptr32 _ADAPTER_OBJECT
   +0x00c MapRegistersPerChannel : Uint4B
   +0x010 AdapterBaseVa    : Ptr32 Void
   +0x014 MapRegisterBase  : Ptr32 Void
   +0x018 NumberOfMapRegisters : Uint4B
   +0x01c CommittedMapRegisters : Uint4B
   +0x020 CurrentWcb       : Ptr32 _WAIT_CONTEXT_BLOCK
   +0x024 ChannelWaitQueue : _KDEVICE_QUEUE
   +0x038 RegisterWaitQueue : Ptr32 _KDEVICE_QUEUE
   +0x03c AdapterQueue     : _LIST_ENTRY
   +0x044 SpinLock         : Uint4B
   +0x048 MapRegisters     : Ptr32 _RTL_BITMAP
   +0x04c PagePort         : Ptr32 UChar
   +0x050 ChannelNumber    : UChar
   +0x051 AdapterNumber    : UChar
   +0x052 DmaPortAddress   : Uint2B
   +0x054 AdapterMode      : UChar
   +0x055 NeedsMapRegisters : UChar
   +0x056 MasterDevice     : UChar
   +0x057 Width16Bits      : UChar
   +0x058 ScatterGather    : UChar
   +0x059 IgnoreCount      : UChar
   +0x05a Dma32BitAddresses : UChar
   +0x05b Dma64BitAddresses : UChar
   +0x05c LegacyAdapter    : UChar
   +0x060 AdapterList      : _LIST_ENTRY
*/

struct _ADAPTER_OBJECT {
    DMA_ADAPTER             DmaHeader;
    struct _ADAPTER_OBJECT  *MasterAdapter;
    ULONG                   MapRegistersPerChannel;
    PVOID                   AdapterBaseVa;
    PVOID                   MapRegisterBase;
    ULONG                   NumberOfMapRegisters;
    ULONG                   CommittedMapRegisters;
    PVOID                   CurrentWcb;
    KDEVICE_QUEUE           ChannelWaitQueue;
    PKDEVICE_QUEUE          RegisterWaitQueue;
    LIST_ENTRY              AdapterQueue;
    KSPIN_LOCK              SpinLock;
    PRTL_BITMAP             MapRegisters;
    PUCHAR                  PagePort;
    UCHAR                   ChannelNumber;
    UCHAR                   AdapterNumber;
    USHORT                  DmaPortAddress;
    UCHAR                   AdapterMode;
    BOOLEAN                 NeedsMapRegisters;
    BOOLEAN                 MasterDevice;
    UCHAR                   Width16Bits;
